Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: - To uncompress a gzipped database, execute this command from a terminal ``gunzip db.sqlite.gz``.
ja: - gzip圧縮されたデータベースを解凍するには、ターミナルから ``gunzip db.sqlite.gz`` のコマンドを実行してください。

source: The end-user copy and paste the URL to the form and submit 2.
ja: エンドユーザーはURLをフォームにコピー・ペーストして投稿します 2.

source: // LDAP user group filter // If this filter is configured, Kanboard will search user groups in LDAP_GROUP_BASE_DN // Example for OpenLDAP: (&(objectClass=posixGroup)(memberUid=%s)) define('LDAP_GROUP_USER_FILTER', '');
ja: // LDAP ユーザーグループフィルター // このフィルターが設定されている場合、Kanboardはユーザーグループを LDAP_GROUP_BASE_DN から探します。 // OpenLDAP の例: (&(objectClass=posixGroup)(memberUid=%s)) define('LDAP_GROUP_USER_FILTER', '');

source: - A user session is created on the server
ja: - サーバー上にユーザーのセッションが生成されます

source: - If you have a question or if you need help, go to the `forum <https://kanboard.discourse.group/>`_.
ja: - もし何か質問があったり、手助けが必要ならば、 `フォーラム <https://kanboard.discourse.group/>`_ に行ってください。

source: - Orders
ja: - 受注

source: [My link title](https://kanboard.org/)
ja: [リンクのタイトル](https://kanboard.org/)

source: Open a command prompt (``cmd.exe``) and go to the directory ``C:\Apache24\bin``:
ja: コマンドプロンプト (``cmd.exe``) を開き、ディレクトリ``C:\Apache24\bin`` に移動する:

source: Search by columns ~~~~~~~~~~~~~~~~~
ja: カラムで検索 ~~~~~~~~~~~~~~~~~

source: - Assign a color to a specific user
ja: - 色をユーザーに割当てる

source: - Shipped
ja: - 出荷

source: - Override default values for task forms
ja: タスクのフォームのデフォルト値をオーバーライド

source: - Purpose: **Get list of actions for a project**
ja: - 用途: **プロジェクトで利用されているアクションの一覧を取得する**

source: warning:: This feature is not maintained anymore.
ja: 警告:: この機能は誰もメンテナンスしていません。

source: Kanban: ~~~~~~~
ja: かんばん: ~~~~~~~

source: Attribute: **status**
ja: 属性: **status**

source: Board with Swimlanes --------------------
ja: スイムレーンのあるボード --------------------

source: # restart apache
ja: #Apache を再起動する

source: Users that belong to this role won’t be able to change the task status in the column “Done”.
ja: - この役割を割り当てられたユーザーは、カラム"Done"ではタスクの状態を変更できません。

source: - Duplicate the task to another project
ja: - 別のプロジェクトにタスクを複製

source: Plugin Directory Configuration ==============================
ja: プラグインディレクトリの設定 ==============================

source: figure:: /_static/subtask-timer.png :alt: Subtask timer
ja: figure:: /_static/subtask-timer.png :alt: サブタスクのタイマー

source: For example, you can link a task to:
ja: 例えば、タスクとこれらをリンクできます:

source: Application Settings --------------------
ja: アプリケーション設定 --------------------

source: When the authentication is successful, the ``AuthenticationManager`` will ask the user information to your driver by calling the method ``getUser()``.
ja: 認証が成功した時, ``AuthenticationManager`` は ``getUser()`` メソッドと呼ばれるドライバを呼び出し、ユーザー情報を問い合わせます。

source: // Run automatically database migrations
ja: // 自動的にデータベースのマイグレーションを実施する

source: figure:: /_static/burndown-chart.png :alt: Burndown chart
ja: figure:: /_static/burndown-chart.png :alt: バーンダウンチャート

source: This interface requires only one method: ``find($input)``.
ja: このインターフェースは ``find($input)`` メソッドのみを要求します。

source: You can also create tags directly from the task form.
ja: また、タスクのフォームから直接タグを作成することもできます。

source: The ``$user`` argument is a dictionary that contains these keys:
ja: ``$user`` の値は以下のキーを含む連想配列です :

source: The Kanboard archive contains a ``web.config`` file to enable URL rewriting.
ja: Kanboardアーカイブに含まれる ``web.config`` ファイルでURL rewritingを有効にします。

source: - Copy and paste the iCal feed URL from Kanboard
ja: - KanboardのiCal Feed URLをコピー・ペーストする

source: This chart shows the average time spent into each column for the last 1000 tasks.
ja: このチャートは、最後の1000個のタスクの各カラムでの平均経過時間を表します。

source: Browsers ~~~~~~~~
ja: ブラウザ ~~~~~~~~

source: From a terminal, run the following command:
ja: ターミナルから、以下のコマンドを実行してください:

source: user:reset-password Change user password
ja: user:reset-password ユーザーのパスワードを変更する

source: - The legend order is the same as the stack in the chart.
ja: - 凡例は、スタックチャートと同様です。

source: - Can be assigned to a project member
ja: - プロジェクトメンバーを割り当てることが出来る

source: Sendmail Configuration ~~~~~~~~~~~~~~~~~~~~~~
ja: Sendmail の設定 ~~~~~~~~~~~~~~~~~~~~~~

source: LDAP Authentication ===================
ja: LDAP 認証 ===================

source: - Each phase can have work-in-progress limits
ja: - 各フェーズに、仕掛の制限を持たせる事ができます

source: - Webhooks can be used to create a task by calling a simple URL (You can also do that with the API)
ja: - Webhooks は単純なURLの呼び出しでタスクの作成ができます。 (また、APIも同じ事が出来ます)

source: - `Portuguese <https://github.com/kanboard/documentation-pt>`_
ja: - `ポルトガル語 <https://github.com/kanboard/documentation-pt>`_

source: The configuration parameter ``LDAP_USER_FILTER`` is used to find users in LDAP directory.
ja: 設定パラメータの ``LDAP_USER_FILTER`` は、LDAPディレクトリからユーザーを見つけるのに使用されます。

source: - **email** (string, required)
ja: - **email** (string, 必須)

source: - Result on success: **List of tags**
ja: - 成功時の返り値: **タグのリスト**

source: User credentials ~~~~~~~~~~~~~~~~
ja: ユーザーの資格情報 ~~~~~~~~~~~~~~~~

source: Your automatic action must inherit of the class ``Kanboard\Action\Base``.
ja: あなたの自動アクションは ``Kanboard\Action\Base`` クラスを継承しなければなりません。

source: Each project manager can authorize the access to a set of groups from the project permissions page.
ja: 各々のプロジェクト管理者は プロジェクト>権限 のページから、グループに対しアクセス権を設定できます。

source: +------------------+----------------+ | Method | Usage | +==================+================+ | ``getTitle()`` | Get link title | +------------------+----------------+ | ``getUrl()`` | Get link URL | +------------------+----------------+ | ``setUrl($url)`` | Set link URL | +------------------+----------------+
ja: +------------------+----------------+ | Method | Usage | +==================+================+ | ``getTitle()`` | リンクのタイトルを取得 | +------------------+----------------+ | ``getUrl()`` | リンクのURLを取得 | +------------------+----------------+ | ``setUrl($url)`` | リンクのURLをセット | +------------------+----------------+

source: - Purpose: **Create a new external link**
ja: - 用途: **新しい外部リンクを作成**

source: - Purpose: **Update a subtask**
ja: - Purpose: **サブタスクをアップデートする**

source: Integration tests are using Docker containers.
ja: 結合テストはDockerコンテナを使用します。

source: Automatically load LDAP groups for project permissions ------------------------------------------------------
ja: 自動的にプロジェクトでの権限のためにLDAPグループを読み込む ------------------------------------------------------

source: // We choose "smtp" as mail transport
ja: // "smtp"をメール送信方法として選択する

source: Scrum: ~~~~~~
ja: スクラム: ~~~~~~

source: Each group can have a different project role assigned.
ja: 各々のグループに個々のプロジェクトの役割を割り当てられます。

source: - **role** (string, required)
ja: - **role** (string, 必須)

source: Kanboard supports natively the TOTP standard.
ja: Kanboard は TOTP 標準をネイティブでサポートしています。

source: Other folders are optional.
ja: それ以外のフォルダーは任意です。

source: - Purpose: **Create a new task relation**
ja: - Purpose: **新しくタスク同士の関連性を作成する**

source: Text strings use the function ``sprintf()`` to replace elements:
ja: テキストの文字列は ``sprintf()`` 関数で要素が置き換えられます:

# - Line return: Unix => `` ``
source: - Line return: Unix => ``\n``
ja: - 改行: Unix => ``\n``

source: Group LDIF example:
ja: Group LDIF の例:

source: figure:: /_static/tags-projects.png :alt: Project Tags
ja: figure:: /_static/tags-projects.png :alt: プロジェクトのタグ

source: Environment Variables ---------------------
ja: 環境変数 ---------------------

source: Each project is isolated from other projects.
ja: 個々のプロジェクトは他のプロジェクトと隔離されています。

source: export
ja: エクスポート

source: - Query for my assigned tasks: ``assignee:me``
ja: - 自分に割当てられたタスクを検索: ``assignee:me``

source: - **is fixed by** \| fixes
ja: - **次に修正されます** \| 次を修正します

source: - Put the web server in maintenance mode to avoid people to use the software while upgrading
ja: - ソフトウェアのアップグレード中にユーザーに使用されるのを避けるため、webサーバーをメンテナンスモードに置く

source: Creating Projects from Another Project ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 他のプロジェクトから新しいプロジェクトを作成する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Each hook is identified with a unique name, example: ``controller:calendar:user:events``
ja: 各々のフックは、例えば ``controller:calendar:user:events`` のように、ユニークな名前で識別されます。

source: The ``event_data`` values are not necessary normalized across events.
ja: ``event_data`` の値はイベントにまたがって正規化するのには必要ではありません。

source: // Return true if the metadata my_plugin_variable exists
ja: // 既にmy_plugin_variable にメタデータがあれば、 true を返す

source: // If you need to change the sendmail command, replace the value define('MAIL_SENDMAIL_COMMAND', '/usr/sbin/sendmail -bs');
ja: // "sendmail" コマンドを変更する必要がある場合、この値を置き換える define('MAIL_SENDMAIL_COMMAND', '/usr/sbin/sendmail -bs');

source: note::
ja: 注意::

source: - Purpose: **Move a task to another project**
ja: - 用途: **タスクを別のプロジェクトに移動**

source: Recommendations ~~~~~~~~~~~~~~~
ja: 推奨事項 ~~~~~~~~~~~~~~~

source: - **Reference**: External ID for the task, for example it can be ticket number that come from another system
ja: - **参照**: 例えば別のソフトウェアから付けられたチケット番号といった、タスクの外部参照IDです。

source: - Kanboard use the complexity or story point to generate this diagram.
ja: - Kanboard はこの図表を生成するために、複雑さ、もしくはストーリーポイントを使用します。

source: Change the value directly in your ``php.ini`` if you can:
ja: 可能なら、直接 ``php.ini`` 内の値を変更します :

source: From the task view, on left sidebar click on **Add a subtask**:
ja: タスクビュー画面を開き、左のサイドバーの **サブタスクを追加** をクリックしてください。

source: You can also add a subtask quickly by entering only the title:
ja: また、サブタスクはタイトルを入力するだけで追加できます:

source: When URL rewriting is enabled, you can define custom routes from your plugins.
ja: URL rewriting を有効にされている時は、プラグインからカスタムルートを定義できます。

source: - **position** (integer, required, must be >= 1)
ja: - **position** (integer, 必須, 正の数であること)

source: // LDAP pattern to use when searching for a user account
ja: // LDAP でユーザーアカウントの検索に使用するパターン

source: - Source column
ja: - 移動元カラム

source: - Result on success: **list of events**
ja: - 成功時の返り値: **イベントのリスト**

source: This **word** is very **important**.
ja: この **言葉** はとても **重要** です。

source: This **word** is very __important__.
ja: この **言葉** はとても __重要__ です。

source: According to your configuration, some features can slow down the usage of Kanboard.
ja: 設定次第で、いくつかの機能はKanboardの実行速度の低下を引き起こし得ます。

source: - Example of possible clients: tools to migrate/import data, create tasks from another system, etc…
ja: - クライアントの例: データのマイグレーション/インポートのためのツール, 別のシステムからのタスク作成, 等・・・

source: Example with Ruby -----------------
ja: Rubyを使用する例 -----------------

source: - The plugin directory must be writeable by the web server user
ja: - プラグインディレクトリへWebサーバーを実行しているユーザーが書き込み可能になっていること

source: Unordered Lists ---------------
ja: 箇条書き ---------------

source: Task transitions CSV export ~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクの推移をCSVでエクスポート ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - ``GoogleUserProvider`` represents a Google user
ja: - ``GoogleUserProvider`` はGoogleのユーザー情報を再送します。

source: Configuration on Microsoft Windows Server -----------------------------------------
ja: Microsoft Windows Server での設定 -----------------------------------------

source: - ``--manager``: Send all overdue tasks to project manager(s) in one email
ja: - ``--manager``: すべての期限切れタスクをプロジェクト管理者に一通のEmailで送信

source: - **targets milestone** \| is a milestone of
ja: - **次のマイルストーンを目標とします** \| 次のタスクのマイルストーンです

source: Moving a task to another project work in the same way as the duplication, you have to choose the new properties of the task.
ja: タスクを別のプロジェクトに移動も、複製の時と同様に、移動先でのタスクのプロパティを選択しなければなりません。

source: How to update an existing translation?
ja: 既にある翻訳を更新するにはどうすれば良いですか?

source: Unit Tests ----------
ja: 単体テスト ----------

source: Cumulative Flow Diagram -----------------------
ja: 累積フロー図 -----------------------

source: Sqlite tests use a in-memory database, nothing is written on the file system.
ja: Sqlite のテストはメモリ上のデータベースで行い、ファイルシステムへの書き込みは行いません。

source: - Uploaded files: ``files/*``
ja: - アップロードされたファイル: ``files/*``

source: - Switch to the Gantt view = **v g**
ja: - ガントチャートビューに切り替え(要プラグイン) = **v g**

source: Go to the menu **Settings**, then choose **Application settings** on the left.
ja: メニューの **設定** を開いてから、左側の **アプリケーション設定** を選択してください。

source: Search by external reference ~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 外部参照で検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - ``AuthenticationManager::EVENT_SUCCESS``: Successful authentication
ja: - ``AuthenticationManager::EVENT_SUCCESS``: 認証成功

source: Example to execute the daily cronjob at 8am:
ja: 毎日午前8時にcronjobを実行する例:

source: - `Czech <https://github.com/kanboard/documentation-cz>`_
ja: - `チェコ語 <https://github.com/kanboard/documentation-cz>`_

source: Examples of remote users:
ja: リモートユーザーの例:

source: - Do not run migrations in parallel from multiple processes
ja: - 複数のプロセスで並行してマイグレーションを実行しないでください。

source: Download the last stable version of PHP from the `official PHP website <http://windows.php.net/download/>`__, choose the **Thread Safe** version and use the exact same build type as Apache: x86 or x64 2.
ja: `official PHP website <http://windows.php.net/download/>`__ から、**Thread Safe**なバージョンで、Apache同様に x86 or x64 を正確に選択して、最新安定版のPHPをダウンロードする。 2.

source: - ``(&(objectClass=user)(sAMAccountName=%s))`` is replaced by ``(&(objectClass=user)(sAMAccountName=my_username))``
ja: - ``(&(objectClass=user)(sAMAccountName=%s))`` は、 ``(&(objectClass=user)(sAMAccountName=my_username))`` に置き換えられます

source: figure:: /_static/task-distribution.png :alt: Task distribution
ja: figure:: /_static/task-distribution.png :alt: タスク分布

source: define('MAIL_SMTP_ENCRYPTION', 'ssl'); // Valid values are "null", "ssl" or "tls"
ja: define('MAIL_SMTP_ENCRYPTION', 'ssl'); // "null", "ssl", "tls" が利用できます

source: - Choose the action: **Assign the task to a specific user**
ja: - アクション: **タスクの担当者を割り当てる** を選択

source: Creating Subtasks -----------------
ja: サブタスクの作成 -----------------

source: JavaScript code ---------------
ja: JavaScript コード ---------------

source: The ``data`` folder is used to store:
ja: ``data`` フォルダには以下のものが保存されます:

source: When upgrading:
ja: アップグレード時には:

source: define('DEBUG', true); define('LOG_DRIVER', 'file'); // Other drivers are: syslog, stdout, stderr, system or file
ja: define('LOG_DRIVER', 'file'); // ドライバは、 syslog, stdout, stderr, system ,file です。

source: Request example to add/update metada of a task:
ja: タスクのメタデータを追加/更新するリクエストの例:

source: - Execute automatic actions connected to the event “Daily background job for tasks”
ja: - イベント"タスクのためのバックグラウンドジョブ（毎日）" に接続された、自動アクションの実行

source: - Purpose: **Get a link by id**
ja: - Purpose: **リンクをIDから取得する**

source: User Settings -------------
ja: ユーザー設定 -------------

source: If there is no opposite, the label is considered bidirectionnal.
ja: 対になるラベルが無い場合、そのラベルは双方向になります。

source: The project `eAccelerator seems dead and not updated since 2012 <https://github.com/eaccelerator/eaccelerator/commits/master>`__.
ja: `eAccelarator プロジェクトは2012年以降活動しておらずアップデートもされていません。 <https://github.com/eaccelerator/eaccelerator/commits/master>`__

source: With the special user ``jsonrpc``:
ja: 特別なユーザー ``jsonrpc`` を使用する例:

source: iCalendar Subscriptions =======================
ja: iCalendar 配信 =======================

source: - Purpose: **Get all overdue tasks**
ja: - 用途: **全ての期限切れタスクを取得する**

source: - All projects have a default swimlane.
ja: - 全てのプロジェクトには規定スイムレーンがあります。

source: - Purpose: **Get list of available automatic actions**
ja: - 用途: **利用可能な自動アクションの一覧を取得する**

source: Here is an example (``C:\kanboard.bat``):
ja: ここに (``C:\kanboard.bat``) の例を示します:

source: // LDAP attribute for username // Example for ActiveDirectory: 'samaccountname' // Example for OpenLDAP: 'uid' define('LDAP_USER_ATTRIBUTE_USERNAME', 'uid');
ja: // LDAP 属性のユーザー名 // ActiveDirectory の例 : 'samaccountname' // OpenLDAP の例 : 'uid' define('LDAP_USER_ATTRIBUTE_USERNAME', 'uid');

source: - ``getUsername()``: Get username
ja: - ``getUsername()``: ユーザー名を取得する

source: User information can be automatically synced with the local database.
ja: ユーザーの情報はローカルのデータベースと自動で同期可能です。

source: To search tasks based on tags, just use the attribute “tag”:
ja: タグに基いてタスクを検索するには、属性"tag"を使用してください:

source: I want to contribute to the code --------------------------------
ja: コードを寄贈したい --------------------------------

source: - Purpose: **Get all available tasks**
ja: - 用途: **全ての活動中のタスクを取得する**

source: Will generate this HTML:
ja: 生成される HTML:

source: This guide will help you to setup step by step Kanboard on a Windows Server with IIS and PHP.
ja: このガイドは、Windows Server上でIISとPHPを利用してKanboardをセットアップするために順を追ったヘルプです。

source: - ``$end`` Calendar end date (string, ISO-8601 format)
ja: - ``$end`` - カレンダーの終了日 (string, ISO-8601 書式)

source: // LDAP password to use for proxy mode
ja: // proxyモードで使用する LDAP password

source: Volumes -------
ja: ボリューム -------

source: Search by tags ~~~~~~~~~~~~~~
ja: タグで検索 ~~~~~~~~~~~~~~

source: // Override API token stored in the database, useful for automated tests define('API_AUTHENTICATION_TOKEN', 'My unique API Token');
ja: // 自動テスト用に、データベースに保存されているトークンをオーバーライドするAPIトークン define('API_AUTHENTICATION_TOKEN', 'My unique API Token');

source: - **is duplicated by** \| duplicates
ja: - **'次に重複しています** \| 次に重複しています

source: figure:: /_static/custom-filter-creation.png :alt: Custom Filter Creation
ja: figure:: /_static/custom-filter-creation.png :alt: カスタムフィルタの作成

source: Using your helper from another class:
ja: 別のクラスからヘルパーを使用する:

source: - Settings/Config: ``$this->configModel``
ja: - 設定: ``$this->configModel``

source: - Result on success: **subtask properties**
ja: - 成功時の返り値: **サブタスクのプロパティ**

source: - Username: username
ja: - Username: ユーザー名

source: From a controller, if you need to perform a redirection:
ja: リダイレクトする必要がある場合、コントローラーから:

source: - Estimation is required
ja: - 見積が必須

source: - Search by task id and task title: ``123``
ja: - タスクIDかタスク名で検索: ``123``

source: - Send a task by email to someone
ja: - タスクをメールで送信

source: Add this configuration in the file ``C:\Apache24\conf\httpd.conf``:
ja: ``C:\Apache24\conf\httpd.conf`` に以下の設定を追加する:

source: The code above will show only tasks in red on the board.
ja: 上述のコードはボード上のタスクを赤のみで表示します。

source: Merge hooks -----------
ja: フックのマージ -----------

source: projects:archive Disable projects not touched during one year
ja: projects:archive 1年間触られていないプロジェクトを無効化する

source: - Change task color when using a specific task link
ja: - 特定のタスクリンクを使用するとタスクの色を変更

source: Adding your Kanboard calendar to Google Calendar ------------------------------------------------
ja: KanboardカレンダーをGoogleカレンダーに追加する ------------------------------------------------

source: The ``.htaccess`` is optional because its content can be included directly in the Apache configuration.
ja: ``.htaccess`` の内容をApacheの設定の中に直接含めることもできるので、.htaccess ファイルは任意です。

source: Configuration:
ja: 設定:

source: Metadata are custom fields, it’s a key/value table.
ja: メタデータは、 キー/値 のテーブルのカスタムフィールドです。

source: Starting the container with Docker Compose:
ja: Docker Compose を利用して、コンテナを開始してください:

source: - If the task is not closed, the current time is used instead of the date of completion.
ja: - タスクがクローズされていない場合、完了までの時間の代わりに現在既に経過した時間で代用します。

source: - The calculated time spent is rounded to the nearest quarter (only for Kanboard < 1.0.32)
ja: - 計算される経過時間は15分単位の最接近丸めです(Kanboard1.0.32以降)。

source: - Purpose: **Create a new subtask**
ja: - 用途: **サブタスクの新規作成**

source: - Result on success: **subtask_id**
ja: - 成功時の返り値: **subtask_id**

source: Update the file ``app/Model/Language.php`` 5.
ja: ``app/Model/Language.php`` ファイルを更新する 5.

source: - Username: **postgres**
ja: - ユーザー名: **postgres**

source: - score
ja: - スコア

source: - Result on success: **color_id**
ja: - 成功時の返り値: **color_id**

source: When I move a task to the column “Work in progress”, assign this task to the current user ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: カラム “Work in Progress” にタスクを移動したら、その人にタスクの担当者を割り当てる ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: note:: Do not ask questions on the bug tracker, use the `forum <https://kanboard.discourse.group/>`_.
ja: 注意:: バグトラッカーで質問をせずに、 `フォーラム <https://kanboard.discourse.group/>`_ を使用してください。

source: If SELinux is enabled, you have to allow Apache to reach out your LDAP server.
ja: SELinuxが有効な場合、ApacheからLDAPサーバーに届くようにしなければなりません。

source: - Automatically assign a color based on a category
ja: - カテゴリに基いて色を変える

source: - **is blocked by** \| blocks
ja: - **次にブロックされています** \| 次をブロックしています

source: Changing Subtask Status -----------------------
ja: サブタスクの状態を変更 -----------------------

source: Each user must enable the notifications in their profile: **User Profile > Notifications**.
ja: 個々のユーザーは、 **プロフィール> 通知** から、通知を有効にしなければなりません。

source: To avoid the automatic detection of URL rewriting from the web server, you can enable this feature in your config file:
ja: WebサーバーのURL rewriteの自動検出を回避するには、以下のように設定ファイルに記述します。

source: Usage: command [options] [arguments]
ja: 使用方法: コマンド [オプション] [引数]

source: Download Apache binary from `Apache Lounge <http://www.apachelounge.com/download/>`__ 2.
ja: `Apache Lounge <http://www.apachelounge.com/download/>`__ からApacheのバイナリをダウンロードする 2.

source: - Purpose: **Assign/Create/Update tags for a task**
ja: - 用途: **タグをタスクに割当て/作成/更新する**

source: figure:: /_static/automatic-action-creation.png :alt: Automatique action
ja: figure:: /_static/automatic-action-creation.png :alt: 自動アクション

source: - Task creation is not permitted - Closing or opening a task is not permitted - Moving a task is not permitted
ja: - タスクの作成を許可しない - タスクの作成/完了を許可しない - タスクの移動を許可しない

source: Attribute: **subtask:assignee**
ja: 属性: **subtask:assignee**

source: // Cache folder to use if cache driver is "file" (must be writeable by the web server user) define('CACHE_DIR', DATA_DIR.DIRECTORY_SEPARATOR.'cache');
ja: // キャッシュのドライバを "file" にした場合、キャッシュのフォルダを使用します。 (webサーバのユーザが書込可でなければなりません) define('CACHE_DIR', DATA_DIR.DIRECTORY_SEPARATOR.'cache');

source: - Changing subtask status from **in progress** to **done** logs the end time but also update the time spent of the subtask and the task
ja: - サブタスクの状態が **in progress** から **done** に変更された時に終了時間を記録し、またサブタスクとタスクの経過時間を更新します。

source: Advanced Search Syntax ======================
ja: 詳細検索の構文について ======================

source: - Purpose: **Get all available categories**
ja: - 用途: **全ての利用可能なカテゴリを取得する**

source: // E-mail address used for the "From" header (notifications) define('MAIL_FROM', 'notifications@kanboard.local');
ja: // (通知時に) "From" ヘッダ で使用するメールアドレス define('MAIL_FROM', 'notifications@kanboard.local');

source: SELinux Restrictions ~~~~~~~~~~~~~~~~~~~~
ja: SELinux の制限 ~~~~~~~~~~~~~~~~~~~~

source: - ``e()``: display text without HTML escaping
ja: - ``e()``: HTMLエスケープ無しで、テキストを表示する

source: Usually, the attributes ``jpegPhoto`` or ``thumbnailPhoto`` are used.
ja: 通常、 ``jpegPhoto`` か ``thumbnailPhoto`` の属性が使用されます。

source: - Columns Restrictions:
ja: - カラムの制限:

source: - ``getExtraAttributes()``: Get extra attributes to set for the user during the local sync
ja: - ``getExtraAttributes()``: ローカルの同期のためにセットする、追加の属性を取得する

source: Groups Management -----------------
ja: グループの管理 -----------------

source: - Leads
ja: - リード(見込み客)

source: - Changing subtask status from **todo** to **in pogress** logs the start time
ja: - サブタスクの状態が **todo** から **in progress** に変更された時、開始時間を記録します。

source: However, **after three authentication failure through the user API**, the account has to be unlocked by using the login form.
ja: しかし、 **ユーザーAPIを通して3回認証に失敗した後は、** ログインフォームを使用することでアカウントのロックを解除しなければなりません。

source: Run Background worker ~~~~~~~~~~~~~~~~~~~~~
ja: バックグラウンドのワーカーを実行する ~~~~~~~~~~~~~~~~~~~~~

source: - Purpose: **Remove an action**
ja: - 用途: **アクションを削除する**

source: - ``uid=%s`` is replaced by ``uid=my_username``
ja: - ``uid=%s`` は ``uid=my_username`` に置き換えられます
